In [1]:
from datascience import *
import numpy as np

%matplotlib inline
import matplotlib.pyplot as plt
plt.style.use('fivethirtyeight')

## Lesson 10: Groups ##

## Grouping by One Column ##

In [2]:
cones = Table.read_table('data/cones.csv')

In [3]:
cones

Flavor     | Color       | Price
strawberry | pink        | 3.55
chocolate  | light brown | 4.75
chocolate  | dark brown  | 5.25
strawberry | pink        | 5.25
chocolate  | dark brown  | 5.25
bubblegum  | pink        | 4.75

In [4]:
type(cones)

datascience.tables.Table

In [5]:
cones.group('Flavor')

Flavor     | count
bubblegum  | 1
chocolate  | 3
strawberry | 2

In [7]:
cones.drop('Color').group('Flavor', np.average)

Flavor     | Price average
bubblegum  | 4.75
chocolate  | 5.08333
strawberry | 4.4

In [10]:
cones.drop('Color').group('Flavor', min)

Flavor     | Price min
bubblegum  | 4.75
chocolate  | 4.75
strawberry | 3.55

## Lists

In [13]:
my_list = [1, 5, 'hello', 5.0]
type(my_list)

list

In [14]:
[1, 5, 'hello', 5.0, make_array(1,2,3)]

[1, 5, 'hello', 5.0, array([1, 2, 3])]

## Grouping by Two Columns ##

In [15]:
nba = Table.read_table('data/nba_salaries.csv').relabeled("'15-'16 SALARY", 'SALARY')
nba

PLAYER           | POSITION | TEAM          | SALARY
Paul Millsap     | PF       | Atlanta Hawks | 18.6717
Al Horford       | C        | Atlanta Hawks | 12
Tiago Splitter   | C        | Atlanta Hawks | 9.75625
Jeff Teague      | PG       | Atlanta Hawks | 8
Kyle Korver      | SG       | Atlanta Hawks | 5.74648
Thabo Sefolosha  | SF       | Atlanta Hawks | 4
Mike Scott       | PF       | Atlanta Hawks | 3.33333
Kent Bazemore    | SF       | Atlanta Hawks | 2
Dennis Schroder  | PG       | Atlanta Hawks | 1.7634
Tim Hardaway Jr. | SG       | Atlanta Hawks | 1.30452
... (407 rows omitted)

In [16]:
nba.group(['TEAM','POSITION'])

TEAM           | POSITION | count
Atlanta Hawks  | C        | 3
Atlanta Hawks  | PF       | 2
Atlanta Hawks  | PG       | 2
Atlanta Hawks  | SF       | 2
Atlanta Hawks  | SG       | 5
Boston Celtics | C        | 3
Boston Celtics | PF       | 2
Boston Celtics | PG       | 4
Boston Celtics | SF       | 2
Boston Celtics | SG       | 4
... (137 rows omitted)

In [20]:
nba.drop('PLAYER').group(['TEAM','POSITION'], np.sum).sort('SALARY sum', descending = True)

TEAM                 | POSITION | SALARY sum
Cleveland Cavaliers  | C        | 31.0094
Los Angeles Lakers   | SF       | 30.9192
Miami Heat           | PF       | 30.5914
Denver Nuggets       | SF       | 28.7831
Indiana Pacers       | SF       | 27.8732
Houston Rockets      | SG       | 27.1756
Sacramento Kings     | C        | 26.9502
Orlando Magic        | PF       | 26.9453
New Orleans Pelicans | SG       | 26.4185
Washington Wizards   | C        | 26.2174
... (137 rows omitted)